---
kind: type
id: T:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionConcreteRound
source: html/940bae95-35af-9cfa-2c88-ab450b33bde1.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionConcreteRound

Creates a new instance of Structural Section Concrete Round shape with the associated set of parameters,
 used to attach to structural element.

## Syntax (C#)
```csharp
public class StructuralSectionConcreteRound : StructuralSectionRound
```